# Константы

1
1.1
"строка"
True
False

None

# Выражения
# Операции

(1 + 2) * 3

1 + 1
x = 2
1 + x
"строка" + " и строка"
("строка" + " и строка") + " и ещё"

# Операторы
# Над числами: + - * / ** %
# Над строками: + %
# Над булевскими значениями: not and or
# Над коллекцией: in

# Числа:

x = 2
y = 2 ** ((x + 3) * 2)

# Строки:

x = "Привет"
y = "Друг"
z = x + " " + y

# Преобразования

x = float("10.5")
x = int("10")
x = int("чебурашка")
y = str(10)

x = int(str(10))

# Булевский тип

a = True
a = False

x = 1
y = x < int("10")

y = "Гиппопотам"
a = (y == "Осьминог")

a = y == "Гиппопотам" and x < 3

# Функции и операции

def plus(a, b):
    return # a + b

plus(1, 2)

# 1 + 2 # Инфиксная нотация
# plus(1, 2) # Префиксная нотация
# (1, 2)plus # Постфиксная нотация -- язык Форт, Java Virtual Machine

def продолжать_ли(x):
    return x < 3

def хватит():
    return False

x = 1
while продолжать_ли(x) and хватит():
    pass